{
    "layout": "speaker.njk",
    "page": {
        "title": "ServerlessDays Cardiff - Mete Atamel",
        "description": "Mete is a Developer Advocate at Google, focused on helping developers with Google Cloud. As a long-time Java and C# developer, he likes to compare the two ecosystems. Prior to Google, he worked at Microsoft, Skype, Adobe, EMC, and Nokia building apps and services on various web, mobile and cloud platforms. Originally from the island of Cyprus, he currently lives in Greenwich of London, not too far away from the prime meridian.",
        "url": "https://cardiff.serverlessdays.io/speakers/mete",
        "image": "https://res.cloudinary.com/dod4lcj3h/image/upload/v1687025803/mete_dsrwqx.jpg"
    },
    "speaker": {
        "name": "Mete Atamel",
        "title": "Developer Advocate, Google",
        "img": "https://res.cloudinary.com/dod4lcj3h/image/upload/v1687025803/mete_dsrwqx.jpg",
        "bio": "Mete is a Developer Advocate at Google, focused on helping developers with Google Cloud. As a long-time Java and C# developer, he likes to compare the two ecosystems. Prior to Google, he worked at Microsoft, Skype, Adobe, EMC, and Nokia building apps and services on various web, mobile and cloud platforms. Originally from the island of Cyprus, he currently lives in Greenwich of London, not too far away from the prime meridian.",
        "talk": {
            "title": "Open standards for building event-driven serverless applications in the cloud",
            "abstract" : "AsyncAPI is an open-source specification for describing and documenting asynchronous APIs, similar to OpenAPI specification for documenting RESTful APIs. CloudEvents is a specification for event data in the cloud. Together, they enable developers to design, document, and test event-driven APIs and to easily share and consume event data across different cloud platforms and ecosystems. In this session, we will explore the benefits of using AsyncAPI and CloudEvents in your serverless applications and how they can help you build asynchronous, event-driven applications that are well-documented, interoperable, and maintainable."
        },
        "social": [
            {
                "name": "Twitter",
                "link": "http://twitter.com/meteatamel",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/v1560336697/Twitter.svg"
            }
        ],
        "links": [
            {
                "text": "",
                "link": ""
            }
        ]
    }
  }