{
    "layout": "speaker.njk",
    "page": {
        "title": "ServerlessDays Cardiff - Usman Khalid",
        "description": "A seasoned software engineer, AWS Certified Solutions Architect and a team coach, currently at LEGO steering the cloud migration journey.",
        "url": "https://cardiff.serverlessdays.io/speakers/usman",
        "image": "https://res.cloudinary.com/dod4lcj3h/image/upload/w_1000,ar_1:1,c_fill,g_auto,e_art:hokusai/v1681473194/Usman-AWS_brtbxy.png"
    },
    "speaker": {
        "name": "Usman Khalid",
        "title": "GM and Director of Events and Workflows, AWS",
        "img": "https://res.cloudinary.com/dod4lcj3h/image/upload/w_1000,ar_1:1,c_fill,g_auto,e_art:hokusai/v1681473194/Usman-AWS_brtbxy.png",
        "bio": "Usman has been with AWS for the last 9 years, starting off as the engineering leader for Auto Scaling and then ultimately becoming the General Manager (GM) of the service before transitioning into his current role as the GM of Events & Workflows organization. Prior to his role at amazon, Usman was a Sr. Software Engineer at Microsoft and a co-founder of a gaming start up building games for the Xbox. Usman has a strong passion for building psychologically safe, high-performing teams and combining that with making developers all over the world more efficient at solving problems",
        "talk": {
            "title": "Future of EDA on AWS",
            "abstract" : "Event-Driven Architectures (EDA) enable loose coupling of services in an system to increase its fault tolerance and resiliency. AWS has been at the forefront of building tools such as EventBridge and Step Functions to enable engineers to build sophisticated EDA based applications deployed in serverless environments, to help drive agility and innovation. In this session, join GM and Director of Events and Workflows at AWS to learn about AWS’ EDA solutions that are changing the way engineers build and run applications. Hear about AWS’s latest innovations in the space and the advantages they drive with serverless compute. Discover AWS vision for the future on marquee products in the events and workflow category that can help address complex use cases."
        },
        "social": [
            {
                "name": "Twitter",
                "link": "https://twitter.com/A_Usman_Khalid",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/v1560336697/Twitter.svg"
            }
        ],
        "links": [
            {
                "text": "",
                "link": ""
            }
        ]
    }
  }